In [34]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [35]:
train = pd.read_csv("loan train.csv") #reading the dataset
test = pd.read_csv("loan test.csv")

# EXPLORING THE DATA

In [36]:
train.head() #checking the first few rows and columns

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [37]:
test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [38]:
train.describe() #summary of the statistics

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [39]:
train.columns #checking all the columns in the dataset

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [40]:
train.shape #checking the number of rows and columns

(614, 13)

In [41]:
train.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [42]:
test.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [43]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

# FILLING MISSING AND NAN VALUES

In [44]:
train["LoanAmount"].fillna((train["LoanAmount"].median()), inplace=True)

In [45]:
train["Loan_Amount_Term"].fillna((train["Loan_Amount_Term"].median()), inplace=True)

In [46]:
train["Credit_History"].fillna((train["Credit_History"].median()), inplace=True)

In [47]:
train["Married"].fillna((train["Married"].mode()[0]), inplace=True)

In [48]:
train["Gender"].fillna((train["Gender"].mode()[0]), inplace=True)

In [49]:
train["Self_Employed"].fillna((train["Self_Employed"].mode()[0]), inplace=True)

In [50]:
train["Dependents"].fillna((train["Dependents"].mode()[0]), inplace=True)

In [51]:
test["Gender"].fillna((test["Gender"].mode()[0]), inplace=True)

In [52]:
test["Self_Employed"].fillna((test["Self_Employed"].mode()[0]), inplace=True)

In [53]:
test["Dependents"].fillna((test["Dependents"].mode()[0]), inplace=True)

In [54]:
test["LoanAmount"].fillna((test["LoanAmount"].median()), inplace=True)

In [55]:
test["Loan_Amount_Term"].fillna((test["Loan_Amount_Term"].median()), inplace=True)

In [56]:
test["Credit_History"].fillna((test["Credit_History"].median()), inplace=True)

In [57]:
train.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [58]:
train.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,614.000000,614.000000,614.000000
mean,5403.459283,1621.245798,145.752443,342.410423,0.855049
std,6109.041673,2926.248369,84.107233,64.428629,0.352339
min,150.000000,0.000000,9.000000,12.000000,0.000000
25%,2877.500000,0.000000,100.250000,360.000000,1.000000
50%,3812.500000,1188.500000,128.000000,360.000000,1.000000
75%,5795.000000,2297.250000,164.750000,360.000000,1.000000
max,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [59]:
train.shape

(614, 13)

# DATA VISUALIZATION

In [60]:
train["Gender"].value_counts()

Male      502
Female    112
Name: Gender, dtype: int64

In [61]:
train["Dependents"].value_counts()

0     360
1     102
2     101
3+     51
Name: Dependents, dtype: int64

In [62]:
train["Married"].value_counts()

Yes    401
No     213
Name: Married, dtype: int64

In [63]:
train["Education"].value_counts()

Graduate        480
Not Graduate    134
Name: Education, dtype: int64

In [64]:
train["Self_Employed"].value_counts()

No     532
Yes     82
Name: Self_Employed, dtype: int64

# FEATURE ENGINEERING

In [65]:
train = train.drop(["Loan_ID", "Dependents"], axis=1) #dropping a column

In [66]:
train.head()

,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,Male,Yes,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [67]:
test = test.drop("Dependents", axis=1)
test.head()

,Loan_ID,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,Graduate,No,2340,2546,100.0,360.0,1.0,Urban
4,LP001051,Male,No,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [68]:
#converting categorical data into vectors that machine can deal with
cleanup_num = {"Loan_Status":   {"Y": 1, "N": 0},
              "Gender":  {"Male": 1, "Female": 0},
              "Married": {"Yes": 1, "No": 0}, "Self_Employed": {"Yes": 1, "No": 0},
              "Education": {"Graduate": 0, "Not Graduate": 1} }

In [69]:
train.replace(cleanup_num, inplace=True)
train.head()

,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0,0,5849,0.0,128.0,360.0,1.0,Urban,1
1,1,1,0,0,4583,1508.0,128.0,360.0,1.0,Rural,0
2,1,1,0,1,3000,0.0,66.0,360.0,1.0,Urban,1
3,1,1,1,0,2583,2358.0,120.0,360.0,1.0,Urban,1
4,1,0,0,0,6000,0.0,141.0,360.0,1.0,Urban,1

In [70]:
train['Property_Area'].replace({'Urban':2,'Semiurban':1,'Rural':0},inplace=True)
train.head()

,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0,0,5849,0.0,128.0,360.0,1.0,2,1
1,1,1,0,0,4583,1508.0,128.0,360.0,1.0,0,0
2,1,1,0,1,3000,0.0,66.0,360.0,1.0,2,1
3,1,1,1,0,2583,2358.0,120.0,360.0,1.0,2,1
4,1,0,0,0,6000,0.0,141.0,360.0,1.0,2,1

In [71]:
cleanup_num1 = {"Dependents":   {"O": 0, "1": 1, "2": 2, "3+": 3},
              "Gender":  {"Male": 1, "Female": 0},"Married": {"Yes": 1, "No": 0}, 
              "Self_Employed": {"Yes": 1, "No": 0},
              "Education": {"Graduate": 0, "Not Graduate": 1} }

In [72]:
test.replace(cleanup_num, inplace=True)
test.head()

,Loan_ID,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,1,1,0,0,5720,0,110.0,360.0,1.0,Urban
1,LP001022,1,1,0,0,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,1,1,0,0,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,1,1,0,0,2340,2546,100.0,360.0,1.0,Urban
4,LP001051,1,0,1,0,3276,0,78.0,360.0,1.0,Urban

In [73]:
test['Property_Area'].replace({'Urban':2,'Semiurban':1,'Rural':0},inplace=True)
test.head()

,Loan_ID,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,1,1,0,0,5720,0,110.0,360.0,1.0,2
1,LP001022,1,1,0,0,3076,1500,126.0,360.0,1.0,2
2,LP001031,1,1,0,0,5000,1800,208.0,360.0,1.0,2
3,LP001035,1,1,0,0,2340,2546,100.0,360.0,1.0,2
4,LP001051,1,0,1,0,3276,0,78.0,360.0,1.0,2

In [74]:
train_data = train.drop('Loan_Status', axis=1)
target = train['Loan_Status']

train_data.shape, target.shape

((614, 10), (614,))

# MODELLING

In [75]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn import metrics
from sklearn.metrics import accuracy_score, f1_score, classification_report 
from sklearn.model_selection import train_test_split

In [76]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold = KFold(n_splits=10, shuffle=True, random_state=1)

In [77]:
model=LogisticRegression()
scoring = "accuracy"

In [78]:
score = cross_val_score(model, train_data, target, cv=k_fold, n_jobs=1, scoring = scoring)

C:\Users\gupta\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
C:\Users\gupta\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
C:\Users\gupta\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
C:\Users\gupta\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
C:\Users\gupta\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\LocalCache\local-packages\Python310\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [79]:
print(score)

[0.74193548 0.85483871 0.77419355 0.77419355 0.8852459  0.86885246
 0.7704918  0.83606557 0.67213115 0.83606557]

In [80]:
round(np.mean(score)*100, 2)

80.14

In [81]:
clf = DecisionTreeClassifier()

In [82]:
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.74193548 0.69354839 0.66129032 0.62903226 0.78688525 0.72131148
 0.7704918  0.6557377  0.59016393 0.67213115]

In [83]:
round(np.mean(score)*100, 2)

69.23

In [84]:
from sklearn.ensemble import RandomForestClassifier

In [85]:
R_clf = RandomForestClassifier(n_estimators=13)
scoring = 'accuracy'
score = cross_val_score(R_clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.72580645 0.82258065 0.74193548 0.75806452 0.78688525 0.83606557
 0.80327869 0.7704918  0.72131148 0.78688525]

In [86]:
round(np.mean(score)*100, 2)

77.53

In [87]:
model.fit(train_data, target)

test_data = test.drop("Loan_ID", axis=1).copy()
prediction = model.predict(test_data)

In [88]:
pickle.dump(model, open('model.pkl','wb'))

In [89]:
pred_cols = pd.DataFrame({
        "Loan_ID": test["Loan_ID"],
        "Loan_Status": prediction
    })

In [90]:
pred_cols.head()

    Loan_ID  Loan_Status
0  LP001015            1
1  LP001022            1
2  LP001031            1
3  LP001035            1
4  LP001051            1